{
  "backend/main.mo": "Actor adds characterId to user profiles and progress, enforcing access control for reading and saving both.",
  "backend/migration.mo": "Migration maps old profiles and progress to new types by adding a default characterId field.",
  "feature_evidence.json": "Feature evidence listing character, selection, persistence, and UI integration features with associated frontend files.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and changes of major frontend files including character and progress handling.",
  "frontend/index.css": "Defines root OKLCH color variables and dark‑mode overrides with Tailwind base styling.",
  "frontend/index.html": "Basic HTML entry point loading the React application via main.tsx.",
  "frontend/src/App.tsx": "Root component managing auth, profile setup, character selection, and game start/load logic.",
  "frontend/src/components/Auth/LoginButton.tsx": "Login/logout button integrating Internet Identity with query cache clearing and loading states.",
  "frontend/src/components/Auth/ProfileSetupModal.tsx": "Modal collecting fighter name and character choice and saving both to the backend profile.",
  "frontend/src/components/CharacterSelectModal.tsx": "Modal for choosing a playable character, showing portraits, bios, and confirming selection.",
  "frontend/src/components/GameLayout.tsx": "Wrapper layout that renders children over an optional blurred background image.",
  "frontend/src/components/Hud.tsx": "HUD displaying character portrait, chapter info, and current stat values from game state.",
  "frontend/src/components/SaveLoadPanel.tsx": "Panel enabling authenticated users to save or load game progress via backend, handling encoding and decoding of character data.",
  "frontend/src/game/challenges/BrawlChallenge.tsx": "Real-time combat mini‑game with attacks, blocks, combos, and dynamic health tracking that returns a scored result.",
  "frontend/src/game/challenges/FocusChallenge.tsx": "Timed clicking challenge where the player clicks rapidly for 10 seconds to earn rewards based on count.",
  "frontend/src/game/challenges/TacticsChallenge.tsx": "Risk‑reward strategy choice challenge that resolves success via random roll and returns stat rewards.",
  "frontend/src/game/challenges/types.ts": "Type definitions for challenge result objects and completion callbacks.",
  "frontend/src/game/challenges/WisdomChallenge.tsx": "Multiple‑choice moral reasoning challenge evaluating wise responses and granting wisdom‑based rewards.",
  "frontend/src/game/characters/characterPersistence.ts": "Utility functions encoding and decoding character IDs between UI strings and backend bigint indices.",
  "frontend/src/game/characters/characters.ts": "Defines character interface, a list of three fighters, and helpers to fetch characters by ID with a default fallback.",
  "frontend/src/game/state/gameState.ts": "Defines game state structure and functions to create, load, and advance game progress, including chapter objectives handling.",
  "frontend/src/game/state/reducer.ts": "Implements a reducer handling choices, challenges, narrative progression, and story-read state updates.",
  "frontend/src/game/story/chapters.ts": "Provides chapter definitions with narratives, choices, and challenge types for the story-driven game.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context, login flow, and identity persistence using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for loading and saving user profiles and progress via the backend actor.",
  "frontend/src/index.css": "Tailwind-based global styles with custom gritty theme variables and utility classes.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider and mounts it to the DOM.",
  "frontend/src/screens/ChapterScreen.tsx": "Renders the chapter gameplay screen, handling narrative progression, choices, challenges, and chapter advancement while syncing local reducer state to the parent.",
  "frontend/src/screens/StartScreen.tsx": "Displays the game's start menu with character selection, authentication UI, and options to start or load a game.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, and clearing URL parameters and session-persisted parameters, supporting both query and hash routing.",
  "frontend/tailwind.config.js": "Configures Tailwind theme settings including fonts, colors, animations, and container behavior with custom extensions for the game's UI style.",
  "project_state.json": "Defines the project's current specification, features, known issues, and requirements for building the Ramayan-inspired game."
}