{
  "backend/main.mo": "Implements access-controlled user profiles and game progress storage using Map, enforcing permissions for viewing and saving data.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Provides prewritten summaries of key frontend files, including styling, state, story content, and challenge implementations.",
  "frontend/index.css": "Defines global CSS variables for light and dark themes using OKLCH values and applies Tailwind base styles.",
  "frontend/index.html": "Basic HTML entry point loading the React app with a placeholder title tag.",
  "frontend/src/App.tsx": "Root React component handling authentication, profile setup, game state transitions, and theme provider setup.",
  "frontend/src/components/Auth/LoginButton.tsx": "Sign-in/sign-out button wired to Internet Identity with loading states and React Query cache clearing on logout.",
  "frontend/src/components/Auth/ProfileSetupModal.tsx": "Modal for first‑time users to enter and save a fighter name with validation and toast feedback.",
  "frontend/src/components/GameLayout.tsx": "Layout wrapper that renders optional background images with dark overlays and positions game content above them.",
  "frontend/src/components/Hud.tsx": "HUD component displaying current round, chapter title, and player stats using styled badges and cards.",
  "frontend/src/components/SaveLoadPanel.tsx": "UI panel enabling authenticated users to save and load game progress to backend, assembling objective and state data.",
  "frontend/src/game/challenges/BrawlChallenge.tsx": "Interactive combat mini‑game with timed enemy attacks, player moves, combos, and scoring that returns a challenge result.",
  "frontend/src/game/challenges/FocusChallenge.tsx": "10‑second click‑based challenge tracking clicks and time, scoring based on performance before returning a result.",
  "frontend/src/game/challenges/TacticsChallenge.tsx": "Choice‑based tactical risk–reward challenge that randomly determines success and returns rewards accordingly.",
  "frontend/src/game/challenges/types.ts": "Defines shared challenge interfaces including result shape and completion callback props.",
  "frontend/src/game/challenges/WisdomChallenge.tsx": "Single‑question moral reasoning challenge awarding rewards based on whether the chosen answer is wise.",
  "frontend/src/game/state/gameState.ts": "Defines game state structure, helpers for creating/loading game data, managing chapters, and determining mission progress.",
  "frontend/src/game/state/reducer.ts": "Reducer updating game state for choices, challenges, narrative progression, and story objectives with clamped stat changes.",
  "frontend/src/game/story/chapters.ts": "Defines story chapter and choice interfaces and exports three narrative chapters with choices and challenge types.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls for profile and progress loading/saving using React Query.",
  "frontend/src/index.css": "Tailwind base styles plus custom gritty-themed CSS variables and utility classes.",
  "frontend/src/main.tsx": "Bootstraps the app with React, QueryClient, and InternetIdentityProvider.",
  "frontend/src/screens/ChapterScreen.tsx": "Renders a chapter view with narrative progression, choices, and challenges tied to game state.",
  "frontend/src/screens/StartScreen.tsx": "Displays the title screen with login, new game, load game, and thematic visuals.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash-based), store/retrieve them in sessionStorage, and clear them from the URL or storage for persistence and security.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom fonts, colors, shadows, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s current state, requirements, known issues, and needed image assets for a Ramayan-inspired game."
}