{
  "kind": "build_request",
  "title": "Add playable character selection and persistence",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-15",
      "text": "Add a small set of predefined playable characters (at least 3) to the street-fighting game, each with a stable characterId, display name, short bio blurb, and portrait image path, and store these definitions in a dedicated frontend module so they can be reused across screens.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "make in it character"
        ]
      },
      "acceptanceCriteria": [
        "There is a single source of truth for character definitions (e.g., an exported array) with at least 3 characters.",
        "Each character definition includes: characterId (string), name (English), bio (English), and portrait image path under /assets/generated/.",
        "CharacterIds are stable strings (not array indexes) and are used consistently across the app."
      ]
    },
    {
      "id": "REQ-16",
      "text": "Implement a character selection UX so the player can choose a character before starting a new game, and ensure the selected character is clearly shown as selected and can be changed before confirming.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "make in it character"
        ]
      },
      "acceptanceCriteria": [
        "From the Start screen, the user can open a character selection UI and pick one character from the predefined list.",
        "The UI shows a clear selected state and a confirmation action (e.g., “Confirm Character”).",
        "Starting a new game is blocked until a character is selected (with an English prompt explaining what to do)."
      ]
    },
    {
      "id": "REQ-17",
      "text": "Persist the selected character for authenticated users by extending the backend user profile to include the chosen characterId, and update the profile setup flow to collect both fighter name and character selection.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "make in it character"
        ]
      },
      "acceptanceCriteria": [
        "Motoko backend UserProfile includes a characterId field (or equivalent) that is saved and returned by getCallerUserProfile.",
        "Profile setup UI collects: fighter name + character selection, validates both, and saves them together.",
        "Existing users without a saved characterId do not crash the app; the UI prompts them to select a character and save/update their profile.",
        "If a state migration is required for existing canister state, a conditional backend/migration.mo is added to preserve prior stored profiles by defaulting characterId to a valid character."
      ]
    },
    {
      "id": "REQ-18",
      "text": "Integrate the selected character into gameplay UI by displaying the chosen character (name and portrait) in the HUD and/or chapter screen, without changing the existing story structure (chapters/choices/challenges).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "make in it character"
        ]
      },
      "acceptanceCriteria": [
        "During gameplay, the HUD or chapter view displays the selected character name and portrait.",
        "The displayed character matches the selection made before starting the game or loaded from the user profile when applicable.",
        "No changes are required to the existing chapter progression, mission objectives logic, or challenge selection flow."
      ]
    },
    {
      "id": "REQ-19",
      "text": "Ensure the selected character is preserved across Save/Load by including characterId in the saved progress payload and restoring it when loading progress.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "make in it character"
        ]
      },
      "acceptanceCriteria": [
        "Backend Progress type includes characterId (or equivalent) and saveProgress/loadProgress round-trip it.",
        "SaveLoadPanel includes characterId when saving, and restores it when loading.",
        "Loading progress saved before this change does not crash; characterId defaults to a valid character and the UI prompts the user to confirm/save if needed."
      ]
    },
    {
      "id": "REQ-20",
      "text": "Render any newly generated character portrait assets as static files under frontend/public/assets/generated and reference them from the character definitions and UI so there are no missing asset paths.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "make in it character"
        ]
      },
      "acceptanceCriteria": [
        "All new character portrait images are placed under frontend/public/assets/generated.",
        "All character portrait references in code use absolute paths starting with /assets/generated/.",
        "App has no broken image links for character portraits on Start screen and in-game UI."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui or any paths listed in frontend.immutablePaths.",
    "Keep the backend as a single Motoko actor in backend/main.mo; only add backend/migration.mo if state upgrade compatibility requires it.",
    "Use English for all new user-facing text.",
    "Do not introduce default blue/purple styling; keep the existing gritty street-fighting aesthetic."
  ],
  "nonGoals": [
    "Do not add multiplayer, real-time features, chat, or leaderboards.",
    "Do not add third-party authentication beyond Internet Identity.",
    "Do not change the existing chapter count or replace the current street-fighting chapter narratives unless strictly required to display the selected character."
  ],
  "imageRequirements": {
    "required": [
      "Street fighter portrait, character 1 (streetfighter-char-1-portrait.dim_768x768.png)",
      "Street fighter portrait, character 2 (streetfighter-char-2-portrait.dim_768x768.png)",
      "Street fighter portrait, character 3 (streetfighter-char-3-portrait.dim_768x768.png)"
    ],
    "edits": []
  }
}