{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Playable character selection, display, and persistence wiring (frontend)",
  "requirements": [
    {
      "id": "REQ-15",
      "summary": "Create a single reusable frontend source of truth for at least 3 predefined playable characters with stable string IDs, bios, and generated portrait paths.",
      "acceptanceCriteria": [
        "There is a single source of truth for character definitions (e.g., an exported array) with at least 3 characters.",
        "Each character definition includes: characterId (string), name (English), bio (English), and portrait image path under /assets/generated/.",
        "CharacterIds are stable strings (not array indexes) and are used consistently across the app."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/characters/characters.ts",
          "operation": "create",
          "description": "Add a dedicated character definitions module exporting an array of at least 3 characters with stable string characterId, English name, English bio, and portraitPath referencing /assets/generated/streetfighter-char-1-portrait.dim_768x768.png, /assets/generated/streetfighter-char-2-portrait.dim_768x768.png, /assets/generated/streetfighter-char-3-portrait.dim_768x768.png. Also export small helpers to resolve character by id and to provide a safe default character. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/game/characters/characterPersistence.ts",
          "operation": "create",
          "description": "Add frontend-only mapping utilities to convert between stable string characterId used in the UI and the bigint-based characterId used by the current backend types (e.g., encode/decode helpers with validation + fallback to a valid default). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-16",
      "summary": "Add a character selection UX from the Start screen that clearly shows selection, allows changing before confirmation, and blocks starting a new game until selected.",
      "acceptanceCriteria": [
        "From the Start screen, the user can open a character selection UI and pick one character from the predefined list.",
        "The UI shows a clear selected state and a confirmation action (e.g., “Confirm Character”).",
        "Starting a new game is blocked until a character is selected (with an English prompt explaining what to do)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/CharacterSelectModal.tsx",
          "operation": "create",
          "description": "Create a character selection modal that lists characters from frontend/src/game/characters/characters.ts, shows portrait/name/bio, supports a clear selected state, and exposes a confirm action + callbacks for select/confirm/close. Use existing shadcn-ui Dialog/Card/Button primitives without modifying frontend/src/components/ui. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/screens/StartScreen.tsx",
          "operation": "modify",
          "description": "Wire a 'Choose Fighter' / character selection entry point on the Start screen, display the currently selected character (name + portrait) when chosen, and update the Start button behavior so starting a new game is blocked until a character is selected with an English prompt telling the user to choose and confirm a fighter first. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add app-level state for the pending/selected character for a new game, pass handlers/props to StartScreen for opening selection and confirming, and ensure createNewGame is only called after a character is confirmed. Ensure selection can be changed before confirming. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/game/state/gameState.ts",
          "operation": "modify",
          "description": "Extend GameState to include selectedCharacterId (stable string), update createNewGame() to require/accept a chosen characterId, and update loadGameFromProgress() to accept/restore a characterId with safe defaulting when missing/invalid. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-17",
      "summary": "Update profile setup UI to collect fighter name plus character selection and save them together; gracefully handle existing profiles missing a character selection.",
      "acceptanceCriteria": [
        "Motoko backend UserProfile includes a characterId field (or equivalent) that is saved and returned by getCallerUserProfile.",
        "Profile setup UI collects: fighter name + character selection, validates both, and saves them together.",
        "Existing users without a saved characterId do not crash the app; the UI prompts them to select a character and save/update their profile.",
        "If a state migration is required for existing canister state, a conditional backend/migration.mo is added to preserve prior stored profiles by defaulting characterId to a valid character."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Auth/ProfileSetupModal.tsx",
          "operation": "modify",
          "description": "Extend the profile setup modal to also collect character selection (using the predefined list) in addition to fighter name, validate both, and save them together. Convert the selected stable string characterId into the bigint form expected by the current backend types using frontend/src/game/characters/characterPersistence.ts. Ensure all new user-facing text is English. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Adjust the profile setup gating so authenticated users with missing/invalid character selection in their loaded profile are prompted to pick a character and save/update. Also, when a valid profile is present, initialize the app's selected character from the profile so other screens can display it. Use the existing authorization-based authenticated profile flow patterns already in App/useQueries; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Ensure the profile save mutation and profile query typing/usage supports saving/reading characterId alongside name (including any necessary frontend-level coercion). Handle authorization failures gracefully in UI via existing toast patterns. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-18",
      "summary": "Display the selected character (name + portrait) during gameplay (HUD and/or chapter view) without altering story/chapter logic.",
      "acceptanceCriteria": [
        "During gameplay, the HUD or chapter view displays the selected character name and portrait.",
        "The displayed character matches the selection made before starting the game or loaded from the user profile when applicable.",
        "No changes are required to the existing chapter progression, mission objectives logic, or challenge selection flow."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Hud.tsx",
          "operation": "modify",
          "description": "Integrate selected character display into the HUD by resolving gameState.selectedCharacterId via the shared character definitions and rendering character name + a small portrait. Keep styling consistent with the existing gritty aesthetic and avoid new blue/purple styling. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/screens/ChapterScreen.tsx",
          "operation": "modify",
          "description": "Replace the generic fighter image in the side panel with the selected character portrait (and optionally name) derived from game state, without changing chapter progression/choices/challenge flow. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/game/state/gameState.ts",
          "operation": "modify",
          "description": "Ensure any state creation/loading paths used by gameplay always yield a valid selectedCharacterId so HUD/ChapterScreen never crash on missing character selection. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-19",
      "summary": "Include characterId in save/load payload wiring so selection round-trips with progress; safely default older saves and prompt user to confirm/save if needed.",
      "acceptanceCriteria": [
        "Backend Progress type includes characterId (or equivalent) and saveProgress/loadProgress round-trip it.",
        "SaveLoadPanel includes characterId when saving, and restores it when loading.",
        "Loading progress saved before this change does not crash; characterId defaults to a valid character and the UI prompts the user to confirm/save if needed."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/SaveLoadPanel.tsx",
          "operation": "modify",
          "description": "When saving, include the current selected character (convert stable string characterId from game state into bigint using frontend/src/game/characters/characterPersistence.ts) in the Progress payload. When loading, read characterId from loaded progress (if present), decode to stable string id with safe defaulting, and pass it through to the load callback. If characterId is missing/invalid (older saves), show an English prompt/toast telling the user to confirm a fighter and re-save. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Extend the onLoadGame plumbing to accept/restores a loaded character selection alongside chapter/state variables/objectives, update app state accordingly, and ensure gameplay displays match loaded selection. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/game/state/gameState.ts",
          "operation": "modify",
          "description": "Update loadGameFromProgress() signature/logic to accept an optional characterId and store it on GameState; default safely for older progress that lacks character selection. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-20",
      "summary": "Add newly generated portrait assets under frontend/public/assets/generated and reference them consistently via absolute /assets/generated paths.",
      "acceptanceCriteria": [
        "All new character portrait images are placed under frontend/public/assets/generated.",
        "All character portrait references in code use absolute paths starting with /assets/generated/.",
        "App has no broken image links for character portraits on Start screen and in-game UI."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/streetfighter-char-1-portrait.dim_768x768.png",
          "operation": "create",
          "description": "Add the generated portrait asset file so character definitions and UI can reference it without broken links."
        },
        {
          "path": "frontend/public/assets/generated/streetfighter-char-2-portrait.dim_768x768.png",
          "operation": "create",
          "description": "Add the generated portrait asset file so character definitions and UI can reference it without broken links."
        },
        {
          "path": "frontend/public/assets/generated/streetfighter-char-3-portrait.dim_768x768.png",
          "operation": "create",
          "description": "Add the generated portrait asset file so character definitions and UI can reference it without broken links."
        },
        {
          "path": "frontend/src/game/characters/characters.ts",
          "operation": "modify",
          "description": "Ensure all portrait references in character definitions use absolute paths beginning with /assets/generated/ and match the generated filenames exactly. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}